---
kind: property
id: P:Autodesk.Revit.DB.DividedSurface.ComponentRotation
source: html/78cdcbbd-b322-c6e7-1465-29f7cc300fce.htm
---
# Autodesk.Revit.DB.DividedSurface.ComponentRotation Property

The rotation of the pattern by a multiple
of 90 degrees.

## Syntax (C#)
```csharp
public ComponentRotation ComponentRotation { get; set; }
```

## Remarks
This property has no effect unless a pattern
is selected (the ObjectType property is not Nothing nullptr a null reference ( Nothing in Visual Basic) ).